DataProcessors/ИА_КСУ_РабочийСтол.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ИА_КСУ_РабочийСтол</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>БПлан</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокИсполнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выполнено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШагФормулы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_Состояния</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяФакт</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/КСУ_ГруппировкаЗадачПлана.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>КСУ_ГруппировкаЗадачПлана</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоВидуЗадач</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоШагамСостояния</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеГруппировать</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ИА_ВидыСтатистик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_ВидыСтатистик</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПеревернутаяСтатистика</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ВидыАналитикиСтатистики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ВидыАналитикиСтатистики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ВидыАналитикиСтатистики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантПолученияДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_ВариантыПолученияДанныхСтатистик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапросОтображаетСостояние</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИтогов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_ВидыИтогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИтоговЗаОдинПериод</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_ВидыИтоговЗаОдинПериод</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтогПроизвольноеВыражение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьКуб</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКуба</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_НомерКуба</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_НастройкаОтбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_Источник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_СоответствиеАналитика1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_СоответствиеАналитика2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_СоответствиеАналитика3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_СоответствиеПериод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_СоответствиеКоличество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_ХранилищеЗапросаКонструктора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаЛинии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_НастройкаОтбораХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабПараметровЗапроса</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗапросаИтоговый</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверочныйСписок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ПроверочныйСписок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаРасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВебУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоляРасшифровки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_ПоляРасшифровки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыЗапроса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
								<v8:TypeSet>cfg:BusinessProcessRoutePointRef</v8:TypeSet>
								<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗависимыеРегистры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Регистр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтатистикиФормулы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статистика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ВидыСтатистик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ИА_КСУ_РабочийСтол/Forms/ПланыСотрудников/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаполнитьДеревоПланов()
	
	ДеревоПланов = ИА_Защита_БП.ПолучитьДеревоПланов(ОтборПост,ОтборОтветсвенный,ОтборПланыПодчиненных,ложь,ГлубинаПросмотра,РежимПросмотра=1);
	ЗначениеВРеквизитФормы(ДеревоПланов,"Планы");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПланы(Команда)
	ЗаполнитьДеревоПланов();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьДеревоПланов();
КонецПроцедуры

&НаКлиенте
Процедура ПланыПриАктивизацииСтроки(Элемент)
	
	ОбновитьШаги();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьШаги() 
	
	Если Элементы.Планы.ТекущаяСтрока = ПредИДСтрокиБП Тогда  // обход глюка 1с с повторным вызовом активизации строки
		возврат;
	КонецЕсли;
	
	Статистика = ПредопределенноеЗначение("Справочник.ИА_ВидыСтатистик.ПустаяСсылка");
	Состояние = ПредопределенноеЗначение("Справочник.ИА_Состояния.ПустаяСсылка");
	ТекЗначение = 0;
	Квота = 0;
	
	ДеревоПлана.ПолучитьЭлементы().Очистить();
	
	тд = Элементы.Планы.ТекущиеДанные;
	ПредИДСтрокиБП = Элементы.Планы.ТекущаяСтрока;

	Если тд = Неопределено Тогда
		ОбновитьИтогиПоШагам();
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(тд.План) Тогда		
		ЗагрузитьПлан(тд.План,тд.Пост);
	КонецЕсли;
	
	ОбновитьИтогиПоШагам();
	
КонецПроцедуры

&НаКлиенте
Процедура ПланыВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	 СтандартнаяОбработка = Ложь;
	 
КонецПроцедуры

 &НаКлиенте
 Процедура ПланыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	 
	 СтандартнаяОбработка = Ложь;
	 
	 тд = Элементы.Планы.ТекущиеДанные;
	 Если ЗначениеЗаполнено(тд.План) Тогда 
		 СтандартнаяОбработка = Ложь;
		 струк = Новый Структура("Ключ", тд.План);
		 ф = ПолучитьФорму("Справочник.ИА_ПланыДействий.ФормаОбъекта",струк);
		 ф.Открыть();
	 КонецЕсли;
	 
 КонецПроцедуры

&НаКлиенте
 Процедура ОтборПостПриИзменении(Элемент)
	 ЗаполнитьДеревоПланов();
 КонецПроцедуры

&НаКлиенте
 Процедура ОтборОтветсвенныйПриИзменении(Элемент)
	 ЗаполнитьДеревоПланов();
 КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	 
	Если ИмяСобытия = "ИА_ПланыДействий_Запись" Тогда
		
		// изменен план действий
		тд = Элементы.Планы.ТекущиеДанные;
		
		Если тд<>Неопределено и тд.План = Параметр Тогда	
			ЗагрузитьПлан(тд.План,тд.Пост);
			ОбновитьИтогиПоШагам();
		КонецЕсли;
		
	КонецЕсли;
	 
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПлан(План, Пост)
	
	ДерРез = РеквизитФормыВЗначение("ДеревоПлана");
	
	ОтборПост1 = ?(РежимПросмотра=1, Неопределено, Пост);
	ИА_Защита_БП.ПолучитьДеревоПлана(ДерРез, План, План.Состояние,,ОтборПост1);
	
	Если План.План.Количество()>0 Тогда
		СтрПлан = План.План[0];
		Статистика = СтрПлан.ВидСтатистики;
		ТекЗначение = СтрПлан.ТекущееЗначениеСтатистики;
		Квота = СтрПлан.КвотаПлан;
	КонецЕсли;
			
	ЗначениеВРеквизитФормы(ДерРез, "ДеревоПлана");
КонецПроцедуры

&НаКлиенте
Процедура ОтборПланыПодчиненныхПриИзменении(Элемент)
	ЗаполнитьДеревоПланов();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОтборПланыПодчиненных = Параметры.ОтборПланыПодчиненных;
	ОтборПост             = Параметры.ОтборПост;
	
	СокрВид = Константы.КСУ_СокращенныйВидПлана.Получить();
	ВидГруппировки = константы.КСУ_ГруппировкаЗадачПлана.Получить();

	Если СокрВид Тогда
		Элементы.ДеревоПланаПродукт.Видимость = ложь;
		Элементы.ДеревоПланаСрокИсполнения.Видимость = ложь;
		Элементы.ДеревоПланаВремяФакт.Видимость = ложь;
		Элементы.ДеревоПланаСодержание.Заголовок = "Задача";
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ГлубинаПросмотраПриИзменении(Элемент)
	ЗаполнитьДеревоПланов();
КонецПроцедуры


&НаКлиенте
Процедура РежимПросмотраПриИзменении(Элемент)
	ЗаполнитьДеревоПланов();
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СложитьВремя(в1, в2)
	Если не ЗначениеЗаполнено(в2) Тогда
		возврат в1;
	КонецЕсли;
	
	возврат в1 + (в2 - Дата(1,1,1));
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ФорматИтога(д1)
	
	Если д1 = дата(1,1,1) Тогда
		возврат "";
	КонецЕсли;
	
	КолЧасов = (День(д1)-1)*24 + Час(д1);
	возврат формат(КолЧасов,"ЧЦ=2; ЧН=; ЧВН=")+":"+формат(Минута(д1),"ЧЦ=2; ЧН=; ЧВН=");
КонецФункции


&НаКлиенте
Процедура ОбновитьИтогиПоШагам()
	//ВремяИтого = Дата(1,1,1);
	//ВремяИтогоФакт = Дата(1,1,1);
	//Выполнено1 = Дата(1,1,1);
	//Для каждого стр из ДеревоПлана.ПолучитьЭлементы() Цикл  // шаги, типы		
	//	Итог11 = Дата(1,1,1);
	//	Итог11Ф = Дата(1,1,1);
	//	Для каждого стр1 из стр.ПолучитьЭлементы() Цикл // задачи
	//		ВремяИтого = СложитьВремя(ВремяИтого , стр1.ВремяПлан);  
	//		ВремяИтогоФакт = СложитьВремя(ВремяИтогоФакт , стр1.ВремяФакт);  
	//		
	//		Итог11 = СложитьВремя(Итог11 , стр1.ВремяПлан);
	//		Итог11Ф = СложитьВремя(Итог11Ф , стр1.ВремяФакт);
	//		Если стр1.Выполнено Тогда
	//			Выполнено1 = СложитьВремя(Выполнено1 , стр1.ВремяПлан);
	//		КонецЕсли;
	//	КонецЦикла;
	//	стр.ВремяПлан = ФорматИтога(Итог11);
	//	стр.ВремяФакт = ФорматИтога(Итог11Ф);
	//	
	//	Элементы.ДеревоПлана.Развернуть(стр.ПолучитьИдентификатор());
	//КонецЦикла;
	//
	//время = ФорматИтога(ВремяИтого);
	//ВремяФакт = ФорматИтога(ВремяИтогоФакт);

	//Выполнено = ФорматИтога(Выполнено1);;
	//
	///////////////////////
	ВремяИтого = Дата(1,1,1);
	ВремяИтогоФакт = Дата(1,1,1);
	Выполнено1 = Дата(1,1,1);
	
	Если ВидГруппировки = ПредопределенноеЗначение("Перечисление.КСУ_ГруппировкаЗадачПлана.НеГруппировать") Тогда
		Для каждого стр1 из ДеревоПлана.ПолучитьЭлементы() Цикл // задачи
			ВремяИтого = СложитьВремя(ВремяИтого , стр1.ВремяПлан);  
			ВремяИтогоФакт = СложитьВремя(ВремяИтогоФакт , стр1.ВремяФакт);  
			Если стр1.Выполнено Тогда
				Выполнено1 = СложитьВремя(Выполнено1 , стр1.ВремяПлан);
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для каждого стр из ДеревоПлана.ПолучитьЭлементы() Цикл  // шаги, типы		
			Если стр.Группировка = Неопределено Тогда
				ВремяИтого = СложитьВремя(ВремяИтого , стр.ВремяПлан);  
				ВремяИтогоФакт = СложитьВремя(ВремяИтогоФакт , стр.ВремяФакт);  
				Если стр.Выполнено Тогда
					Выполнено1 = СложитьВремя(Выполнено1 , стр.ВремяПлан);
				КонецЕсли;
			Иначе
				Итог11 = Дата(1,1,1);
				Итог11Ф = Дата(1,1,1);
				Для каждого стр1 из стр.ПолучитьЭлементы() Цикл // задачи
					ВремяИтого = СложитьВремя(ВремяИтого , стр1.ВремяПлан);  
					ВремяИтогоФакт = СложитьВремя(ВремяИтогоФакт , стр1.ВремяФакт);  
					
					Итог11 = СложитьВремя(Итог11 , стр1.ВремяПлан);
					Итог11Ф = СложитьВремя(Итог11Ф , стр1.ВремяФакт);
					Если стр1.Выполнено Тогда
						Выполнено1 = СложитьВремя(Выполнено1 , стр1.ВремяПлан);
					КонецЕсли;
				КонецЦикла;
				стр.ВремяПлан = ФорматИтога(Итог11);
				стр.ВремяФакт = ФорматИтога(Итог11Ф);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	время = ФорматИтога(ВремяИтого);
	ВремяФакт = ФорматИтога(ВремяИтогоФакт);

	Выполнено = ФорматИтога(Выполнено1);;
КонецПроцедуры
